# SQL Queries (Part I)

![Figure 1](Bank%20Example%20-%20Printable.png "Bank Database")

In [48]:
%load_ext sql
%config SqlMagic.displaycon = 0
%config SqlMagic.displaylimit = 100
%sql postgresql+psycopg://bank:bank@postgres/bank

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

Connecting and switching to connection 'postgresql+psycopg://bank:***@postgres/bank'

## 1. Simple Queries

(a) Who are the customers that live in Lisbon?

In [3]:
%%sql
SELECT DISTINCT
  customer_name
FROM
  customer
WHERE
  customer_city = 'Lisbon';

3 rows affected.

+---------------+
| customer_name |
+---------------+
|     Adams     |
|      Cook     |
|     Parker    |
+---------------+

(b) What would be the new account balances at Downtown branch if it offered a 27.7% bonus on the current balance of the customers?

In [15]:
%%sql
SELECT 
  account_number, (balance*1.277) AS new_balance
FROM
  account
WHERE 
  branch_name = 'Downtown';

2 rows affected.

+----------------+--------------+
| account_number | new_balance  |
+----------------+--------------+
|     A-101      | 638.5000000  |
|     A-444      | 1085.4500000 |
+----------------+--------------+

## 2. Join Queries

(a) In which cities do the customers with loans between 1000€ and 2000€ live?

In [19]:
%%sql
SELECT DISTINCT
  c.customer_city
FROM
    customer AS c
    NATURAL JOIN borrower AS b
    NATURAL JOIN loan AS l
WHERE
  l.amount >= 1000 
  AND l.amount <= 2000;

3 rows affected.

+---------------+
| customer_city |
+---------------+
|    Coimbra    |
|      Faro     |
|     Oporto    |
+---------------+

(b) Who are the customers that live in cities that have bank branches?

In [20]:
%%sql
SELECT DISTINCT
  customer_name,
  customer_city
FROM
  customer c
  JOIN branch b ON c.customer_city = b.branch_city;

8 rows affected.

+---------------+---------------+
| customer_name | customer_city |
+---------------+---------------+
|     Brown     |     Oporto    |
|    Johnson    |    Cascais    |
|     Davis     |     Oporto    |
|     Lopez     |   Vila Real   |
|      Cook     |     Lisbon    |
|     Parker    |     Lisbon    |
|     Adams     |     Lisbon    |
|     Oliver    |     Oporto    |
+---------------+---------------+

## 3. More Complex General Queries

(a) Who are the customers who live in cities where there are no bank branches?

In [22]:
%%sql
SELECT
  customer_name
FROM
  customer
WHERE
  customer_city NOT IN (
    SELECT DISTINCT
      branch_city
    FROM
      branch
  );

7 rows affected.

+---------------+
| customer_name |
+---------------+
|     Evans     |
|     Flores    |
|    Gonzalez   |
|    Iacocca    |
|      King     |
|     Martin    |
|     Nguyen    |
+---------------+

(b) What is the total amount of account balances in branches in the city of Lisbon (‘Lisbon’)?

In [23]:
%%sql
SELECT
  SUM(balance)
FROM
  account
  NATURAL JOIN branch
WHERE
  branch_city = 'Lisbon';

1 rows affected.

+-----------+
|    sum    |
+-----------+
| 2950.0000 |
+-----------+

(c) What are the names and addresses of clients who have a bank account but no loans?

In [24]:
%%sql

SELECT
    customer_name,
    customer_street,
    customer_city
FROM
    customer
WHERE
    customer_name IN (
        SELECT
            customer_name
        FROM
            depositor)
    AND customer_name NOT IN (
        SELECT
            customer_name
        FROM
            borrower);

4 rows affected.

+---------------+-----------------+---------------+
| customer_name | customer_street | customer_city |
+---------------+-----------------+---------------+
|     Evans     |  Forest Street  |    Coimbra    |
|     Flores    |  Station Street |     Braga     |
|    Johnson    |    New Street   |    Cascais    |
|     Oliver    |   First Street  |     Oporto    |
+---------------+-----------------+---------------+

(d)	Who are the clients who have a loan at a branch in the same city where they live?

In [13]:
%%sql

SELECT customer_name, l.loan_number, c.customer_city AS city 
FROM borrower b
    NATURAL JOIN loan l
    NATURAL JOIN customer c
    NATURAL JOIN branch r
WHERE branch_city = c.customer_city;

2 rows affected.

+---------------+-------------+--------+
| customer_name | loan_number |  city  |
+---------------+-------------+--------+
|      Cook     |    L-15     | Lisbon |
|     Parker    |    L-20     | Lisbon |
+---------------+-------------+--------+

(e)	What is the total amount of account balances in branches of the city of Amadora?

In [14]:
%%sql

SELECT sum(balance) AS sum_balance_amadora
FROM branch b
    NATURAL JOIN account a
WHERE branch_city = 'Amadora';

1 rows affected.

+---------------------+
| sum_balance_amadora |
+---------------------+
|      1400.0000      |
+---------------------+

(f)	How many clients have at least one bank account and no loan?

In [18]:
%%sql

SELECT COUNT(DISTINCT customer_name) AS clients_with_account_and_no_loan
FROM depositor d
WHERE d.customer_name NOT IN (
    SELECT b.customer_name
    FROM borrower b
);

1 rows affected.

+----------------------------------+
| clients_with_account_and_no_loan |
+----------------------------------+
|                4                 |
+----------------------------------+

(g) What is the number of accounts on each city that has a branch?

In [25]:
%%sql

SELECT branch_city, COUNT(*)
FROM branch b
    NATURAL JOIN account a
GROUP BY branch_city;

4 rows affected.

+-------------+-------+
| branch_city | count |
+-------------+-------+
|    Lisbon   |   4   |
|  Vila Real  |   1   |
|   Amadora   |   2   |
|   Cascais   |   2   |
+-------------+-------+

(h) List, alphabetically, the names of customers who have more than two bank accounts.

In [31]:
%%sql

SELECT
    customer_name,
    COUNT(account_number) AS number_of_accounts
FROM
    depositor
GROUP BY
    customer_name
HAVING
    COUNT(account_number) >= 2
ORDER BY
    customer_name ASC;

3 rows affected.

+---------------+--------------------+
| customer_name | number_of_accounts |
+---------------+--------------------+
|     Brown     |         2          |
|      Cook     |         2          |
|    Johnson    |         2          |
+---------------+--------------------+

(i) Which branches have fewer real assets (sum of all balances of all accounts) than liabilities (total
amount of loans)?

In [49]:
%%sql

SELECT 
    a.branch_name,
    a.real_assets,
    l.liabilities
FROM 
    (SELECT branch_name, SUM(balance) AS real_assets
     FROM account
     GROUP BY branch_name) AS a
JOIN 
    (SELECT branch_name, SUM(amount) AS liabilities
     FROM branch
     NATURAL JOIN loan
     GROUP BY branch_name) AS l
ON a.branch_name = l.branch_name
WHERE l.liabilities > a.real_assets;

5 rows affected.

+-------------+-------------+-------------+
| branch_name | real_assets | liabilities |
+-------------+-------------+-------------+
|    Uptown   |  1600.0000  |  10000.0000 |
|  Round Hill |   800.0000  |  6000.0000  |
|    Metro    |   600.0000  |  5000.0000  |
|   Central   |  1300.0000  |  11000.0000 |
|   Downtown  |  1350.0000  |  13000.0000 |
+-------------+-------------+-------------+

(j) What are the branch names and the difference between the total balance of their accounts and the
total amount of their loans?

In [3]:
%%sql

SELECT
    branch_name,
    COALESCE(total_assets, 0) - COALESCE(total_liabilities, 0) AS difference
FROM
    branch
    LEFT JOIN (
    SELECT
        branch_name,
        SUM(balance) AS total_assets
    FROM
        account
    GROUP BY
        branch_name) a USING (branch_name)
    LEFT JOIN (
    SELECT
        branch_name,
        SUM(amount) AS total_liabilities
    FROM
        loan
    GROUP BY
        branch_name) l USING (branch_name);

9 rows affected.

+---------------+-------------+
|  branch_name  |  difference |
+---------------+-------------+
|    Downtown   | -11650.0000 |
|    Central    |  -9700.0000 |
|     Uptown    |  -8400.0000 |
|     Metro     |  -4400.0000 |
|   Round Hill  |  -5200.0000 |
| Ship Terminal |      0      |
|     Bolsa     |      0      |
|   University  |   650.0000  |
|   Wine Celar  |      0      |
+---------------+-------------+

(k) Who are the customers whose total of their debts (loans) is greater than the total of their assets
(accounts)?

In [22]:
%%sql

SELECT 
    x.customer_name,
    assets,
    debts
FROM 
    (SELECT d.customer_name, SUM(balance) AS assets
     FROM depositor d
     LEFT JOIN account a USING (account_number) 
     GROUP BY d.customer_name) AS x 
JOIN 
    (SELECT b.customer_name, SUM(amount) AS debts
     FROM borrower b
     LEFT JOIN loan l USING (loan_number)
     GROUP BY b.customer_name) AS y 
ON x.customer_name = y.customer_name
WHERE y.debts > x.assets;

3 rows affected.

+---------------+-----------+------------+
| customer_name |   assets  |   debts    |
+---------------+-----------+------------+
|    Iacocca    |  650.0000 | 8000.0000  |
|      Cook     | 1200.0000 | 3000.0000  |
|     Brown     | 1450.0000 | 17000.0000 |
+---------------+-----------+------------+

(l) Which branch has the highest account average balance (among all agencies)?

In [23]:
%%sql

SELECT
    branch_name
FROM
    account
GROUP BY
    branch_name
HAVING
    AVG(balance) >= ALL (
        SELECT
            AVG(balance)
        FROM
            account
        GROUP BY
            branch_name);

2 rows affected.

+-------------+
| branch_name |
+-------------+
|    Uptown   |
|  Round Hill |
+-------------+

(m) How many customers exist per branch city (considering all branches)?

In [44]:
%%sql

SELECT branch_city, COUNT(DISTINCT customer_name) AS total_customers
FROM (
    SELECT d.customer_name, b.branch_city
    FROM depositor d
    JOIN account a ON d.account_number = a.account_number
    JOIN branch b ON a.branch_name = b.branch_name

    UNION

    SELECT br.customer_name, b.branch_city
    FROM borrower br
    JOIN loan l ON br.loan_number = l.loan_number
    JOIN branch b ON l.branch_name = b.branch_name
) AS combined
GROUP BY branch_city;

4 rows affected.

+-------------+-----------------+
| branch_city | total_customers |
+-------------+-----------------+
|   Amadora   |        3        |
|   Cascais   |        3        |
|    Lisbon   |        7        |
|  Vila Real  |        1        |
+-------------+-----------------+

(n) What is the name and address of the customer who has the greatest total balance?

In [45]:
%%sql

SELECT
    customer_name,
    customer_city,
    customer_street
FROM
    customer
WHERE
    customer_name IN (
        SELECT
            customer_name
        FROM
            depositor
            JOIN account USING (account_number)
        GROUP BY
            customer_name
        HAVING
            SUM(balance) >= ALL (
                SELECT
                    SUM(balance)
                FROM
                    depositor
                    JOIN account USING (account_number)
                GROUP BY
                    customer_name));

1 rows affected.

+---------------+---------------+-----------------+
| customer_name | customer_city | customer_street |
+---------------+---------------+-----------------+
|     Brown     |     Oporto    |   Main Street   |
+---------------+---------------+-----------------+

(o) Which cities have a branch?

In [46]:
%%sql

SELECT DISTINCT
    branch_city
FROM
    branch b;

5 rows affected.

+-------------+
| branch_city |
+-------------+
|    Lisbon   |
|  Vila Real  |
|    Oporto   |
|   Amadora   |
|   Cascais   |
+-------------+

(p) Which branches have an account with more than one owner?

In [47]:
%%sql

SELECT
    branch_name
FROM
    branch b
WHERE
    EXISTS (
        SELECT
            *
        FROM
            account a
        WHERE
            a.branch_name = b.branch_name
            AND 1 < (
                SELECT
                    COUNT(*)
                FROM depositor d
                WHERE
                    d.account_number = a.account_number));

1 rows affected.

+-------------+
| branch_name |
+-------------+
|   Downtown  |
+-------------+

(q) Who are the clients who have accounts at all branches in the same city where they live?

In [51]:
%%sql

SELECT DISTINCT
    c.customer_name
FROM
    depositor d
    JOIN customer c USING (customer_name)
WHERE
    NOT EXISTS (
        SELECT
            branch_name
        FROM
            branch
        WHERE
            branch_city = c.customer_city
        EXCEPT
        SELECT
            branch_name
        FROM
            depositor d
            JOIN account USING (account_number)
        WHERE
            d.customer_name = c.customer_name);

4 rows affected.

+---------------+
| customer_name |
+---------------+
|      Cook     |
|     Evans     |
|     Flores    |
|    Iacocca    |
+---------------+